app/views/authors/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 1]]
---
<ul>
  <% @author.posts.each do |post| %>